// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б


let b = 6;

function rectangleArea(a,b){

    let res = a * b;
    return res;
}


console.log( 'rectangle area is:' + rectangleArea(4, b))


// - створити функцію яка обчислює та повертає площу кола з радіусом r
let p = 3.14

function circleArea(r,p){
    let res = p * r * r ;
    return res;
}
console.log('circle area is:' +circleArea(12,p))


// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

function cylinder( h, r){
    let res = r* ( h * r);
    return res
}
console.log('cylinder area is:' + cylinder(12,5) )



// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13